000001210205
000100210131       DCL-F COVIDDSP WORKSTN;
000101210203       DCL-F COVIDINFO WORKSTN;
000102210212       dcl-s tempage int(5);
000104210212       EXSR CLEAR;
000106210212       EXFMT RISKFACTOR;
000108210212       DOW NOT(*IN03);
000112210204         IF GENDER = ' ';
000113210212           *IN95 = *ON;
000114210131           EXFMT RISKFACTOR;
000115210212           *in95 = *OFF;
000116210131           ITER;
000117210131
000118210131         ELSEIF CVDISEASE = ' ';
000119210131           *IN96 = *ON;
000120210131           EXFMT RISKFACTOR;
000121210131           *in96 = *OFF;
000122210131           ITER;
000123210131
000124210131         ELSEIF DIABETES = ' ';
000125210131           *IN97 = *ON;
000126210131           EXFMT RISKFACTOR;
000127210131           *in97 = *OFF;
000128210131           ITER;
000129210131
000130210131         ELSEIF RSPDISEASE = ' ';
000131210131           *IN98 = *ON;
000132210131           EXFMT RISKFACTOR;
000133210131           *in98 = *OFF;
000134210131           ITER;
000135210131
000136210131         ELSEIF HBPRESSURE = ' ';
000137210131           *IN99 = *ON;
000138210131           EXFMT RISKFACTOR;
000139210131           *in99 = *OFF;
000140210131           ITER;
000141210131
000142210212         ELSE;
000144210131           EXSR DETERMINERISK;
000145210212           TOTALQ = TOTALQ +1;
000146210212           *IN60 = *ON;
000147210212           WRITE RISKFACTOR;
000148210212           EXFMT RISKASSMNT;
000149210212
000151210212          IF *IN01 = *on;
000152210212             EXFMT CINFO;
000154210205             WRITE RISKFACTOR;
000155210205             EXFMT RISKASSMNT;
000156210212           ENDIF;
000159210212           *IN60 = *OFF;
000161210203         ENDIF;
000162210131
000163210212         IF *IN03 = *OFF;
000164210203           EXSR CLEAR;
000165210203           EXFMT RISKFACTOR;
000166210203         ENDIF;
000167210131
000168210131       ENDDO;
000169210131
000170210131       *INLR = *ON;
000171210131       RETURN;
000172210131
000173210131       BEGSR CLEAR;
000174210203         *IN95 = *OFF;
000175210203         CLEAR BIRTHDATE;
000176210212         CLEAR GENDER;
000177210212         CVDISEASE ='';
000178210203         CLEAR DIABETES;
000179210203         CLEAR RSPDISEASE ;
000180210203         CLEAR HBPRESSURE;
000181210131       ENDSR;
000182210131
000183210212       BEGSR DETERMINERISK;
000185210212         tempage = %DIFF(%DATE():BIRTHDATE:*Y);
000186210212         IF tempage > 999;
000187210204           AGE = 999;
000188210205         else;
000189210212           age = tempage;
000190210212         ENDIF;
000193210203         SELECT;
000194210203         WHEN AGE >= 80;
000195210203           FRATE =   14.800;
000196210203         WHEN AGE >= 70;
000197210203           FRATE =   8.000;
000198210203         WHEN AGE >= 60;
000199210203           FRATE =   3.600;
000200210203         WHEN AGE >= 50;
000201210203           FRATE =   1.300;
000202210203         WHEN AGE >= 40;
000203210203           FRATE =   0.400;
000204210203         WHEN AGE >= 30;
000205210203           FRATE =   .250;
000206210203         WHEN AGE >= 20;
000207210203           FRATE =   .230;
000208210203         WHEN AGE >= 10;
000209210203           FRATE =   .200;
000210210203         OTHER;
000211210203           FRATE =   .100;
000212210212         ENDSL;
000214210203         IF GENDER = 'F';
000215210203           FRATE -= 0.05;
000216210212         ENDIF;
000218210203         IF CVDISEASE = 'Y';
000219210203           FRATE += .8;
000220210203         ENDIF;
000221210203         IF DIABETES = 'Y';
000222210203           FRATE += .6;
000223210203         ENDIF;
000224210203         IF RSPDISEASE = 'Y';
000225210203           FRATE += .4;
000226210203         ENDIF;
000227210203         IF  HBPRESSURE = 'Y';
000228210203           FRATE += .3;
000229210212         ENDIF;
000232210203         SELECT;
000233210203         WHEN FRATE >9.4;
000234210203           COHORT = 'GROUP 1';
000235210203         WHEN FRATE >5.4;
000236210203           COHORT = 'GROUP 2';
000237210203         WHEN FRATE >3.4;
000238210203           COHORT = 'GROUP 3';
000239210203         WHEN FRATE >1.4;
000240210203           COHORT = 'GROUP 4';
000241210203         OTHER;
000242210203           COHORT = 'GROUP 5';
000243210212         ENDSL;
000245210203       ENDSR;
