000100210221     A                                      DSPSIZ(24 80 *DS3)
000101210221     A          R RECORD1                   CF03(03 'Exit Program')
000102210218     A                                      CF12(12 'Command Line')
000103210218     A                                      CF21(21)
000104210219     A                                  2 29'Tianjing Qiu LAB 4'
000105210218     A                                  5  3'Please select one of the following-
000106210218     A                                       options:'
000107210218     A                                  9 14'3.  Maximum Invalid Signon Attempt-
000108210218     A                                      s allowed'
000109210218     A                                 11 14'5.  Operating system level'
000110210218     A                                  7 14'1.  Signed on User''s Message Queu-
000111210218     A                                      e'
000112210218     A                                 13 11'Option:'
000113210218     A                                 23  4'F3 - Exit'
000114210218     A                                 23 17'F21 - Command Line'
000115210219     A                                  1  3'Tianjing Qiu'
000116210218     A                                 10 14'4.  Previous sign on by signed on -
000117210218     A                                      user'
000118210218     A                                  8 14'2.  Run COVID Application'
000119210218     A                                  2  3USER
000120210221     A            OPTION         2A  B 13 20
000122210218     A  30                                  DSPATR(PC)
000123210221     A  30                                  DSPATR(RI)
000124210218     A                                  1 71DATE
000125210218     A                                  2 70TIME
000126210218     A            MSGTXT1       70   O 16  4
000127210218     A            MSGTXT2       70   O 17  4
000128210221     A  30                             13 31'A valid option must be entered'
