000100210218             PGM
000101210218             CALL       PGM(QGPL/STRJOB)
000103210218             ADDLIBLE   BCI433LIB
000104210218             MONMSG     MSGID(CPF2103)
000110210218             DSPSYSLVL  OUTPUT(*DISPLAY)
000111210218             ENDPGM
